&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем СтроковыеУтилиты;

#Область ИнтерфейсТестирования

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	СтроковыеУтилиты = КонтекстЯдра.Плагин("СтроковыеУтилиты");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("ТестДолжен_ПроверитьНаличиеРеквизита_ИмяФайла", , "Проверка наличия реквизита ""ИмяФайла""");
	НаборТестов.Добавить("ТестДолжен_ПроверитьТипРеквизита_ИмяФайла_Строка500", , "Проверка типа реквизита ""ИмяФайла"" = Строка(500)");
КонецПроцедуры 

#КонецОбласти

#Область СамиТесты

&НаКлиенте
Процедура ТестДолжен_ПроверитьНаличиеРеквизита_ИмяФайла() Экспорт

	Ожидаем.Что(ПроверитьНаличиеРеквизита("ИмяФайла"), "У обработки нет реквизита ""Имя файла""").ЭтоИстина();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестДолжен_ПроверитьТипРеквизита_ИмяФайла_Строка500() Экспорт

	Ожидаем.Что(ПроверитьТипРеквизита("ИмяФайла"), "У реквизита обработки ""Имя файла"" тип не Строка(500)").ЭтоИстина();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеВызовы

&НаСервере
Функция ПроверитьНаличиеРеквизита(ИмяРеквизита)                                                           
	ВнешняяОбработка = ВнешниеОбработки.Создать("D:\mm2tex\build\mm2tex.epf");
	Возврат ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита,  ВнешняяОбработка.Метаданные());
КонецФункции

&НаСервере
Функция ПроверитьТипРеквизита(ИмяРеквизита)                                                           
	ВнешняяОбработка = ВнешниеОбработки.Создать("D:\mm2tex\build\mm2tex.epf");
	ТипЗначения = ОбщегоНазначения.ОписаниеТипаСтрока(500);  
	Возврат ВнешняяОбработка.Метаданные().Реквизиты.ИмяФайла.Тип = ТипЗначения;
КонецФункции

#КонецОбласти
