
&НаСервере
Процедура ВыполнитьПреобразованиеНаСервере()
	РезультатЧтения = РазобратьXML();
	ТитульныйЛист = СформироватьТитульныйЛист(РезультатЧтения);
КонецПроцедуры

&НаСервере
Функция СформироватьТитульныйЛист(РезультатЧтения)
	//ВызватьИсключение "Не реализовано";
	ТитульныйЛист = Новый ТекстовыйДокумент;  
	ТитульныйЛист.ДобавитьСтроку("\thispagestyle{titlepage}");
	ТитульныйЛист.ДобавитьСтроку("");
	ТитульныйЛист.ДобавитьСтроку("\vspace*{8cm}");
	ТитульныйЛист.ДобавитьСтроку("");
	ТитульныйЛист.ДобавитьСтроку("\begin{center}");
	ТитульныйЛист.ДобавитьСтроку("    {\LARGE "+РезультатЧтения.node.TEXT+"\\ [1cm] }");
	ТитульныйЛист.ДобавитьСтроку("\end{center}");

	Возврат ТитульныйЛист;
КонецФункции

&НаСервере
Функция СформироватьТекстФайлаРаздела(СтруктураРаздела)
	ТекстРаздела = "";
	Если СтруктураРаздела = Неопределено Тогда
		Возврат ТекстРаздела;
	КонецЕсли;
	ТекстРаздела = "\section{"+СтруктураРаздела.TEXT+"}"+Символы.ПС+Символы.ПС;
	Если СтруктураРаздела.Свойство("node") Тогда
		Если ТипЗнч(СтруктураРаздела.node) = Тип("Массив") Тогда
			Для каждого Узел из СтруктураРаздела.node Цикл
				Если Узел <> Неопределено И Узел.Свойство("TEXT") Тогда
					ТекстРаздела = ТекстРаздела + "\subsection{"+Узел.TEXT+"}"+Символы.ПС+Символы.ПС;  
				КонецЕсли;
				Если Узел.Свойство("node") Тогда
					Если ТипЗнч(Узел.node) = Тип("Массив") Тогда
						Для каждого УзелПодраздела из Узел.node Цикл
							Если УзелПодраздела <> Неопределено И УзелПодраздела.Свойство("TEXT") Тогда
								ТекстРаздела = ТекстРаздела + "\subsubsection{"+УзелПодраздела.TEXT+"}"+Символы.ПС+Символы.ПС;
							КонецЕсли;
						КонецЦикла;
					Иначе
						Если Узел.node <> Неопределено И Узел.node.Свойство("TEXT") Тогда
							ТекстРаздела = ТекстРаздела + "\subsubsection{"+Узел.node.TEXT+"}"+Символы.ПС+Символы.ПС;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если СтруктураРаздела.node.Свойство("TEXT") Тогда
				ТекстРаздела = ТекстРаздела + "\subsection{"+СтруктураРаздела.node.TEXT+"}"+Символы.ПС+Символы.ПС;
			КонецЕсли;
			Если СтруктураРаздела.node.Свойство("node") Тогда 
				Если ТипЗнч(СтруктураРаздела.node.node) = Тип("Массив") Тогда
					Для каждого УзелПодраздела из СтруктураРаздела.node.node Цикл
						Если УзелПодраздела.Свойство("TEXT") Тогда
							ТекстРаздела = ТекстРаздела + "\subsubsection{"+УзелПодраздела.TEXT+"}"+Символы.ПС+Символы.ПС;
						КонецЕсли;
					КонецЦикла;
				Иначе
					Если СтруктураРаздела.node.node.Свойство("TEXT") Тогда
						ТекстРаздела = ТекстРаздела + "\subsubsection{"+СтруктураРаздела.node.node.TEXT+"}"+Символы.ПС+Символы.ПС;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстРаздела;
КонецФункции

&НаСервере
Функция ПолучитьТекстПараграфа(СтруктураЗаметки)
	ТекстПараграфа = "";
	Если СтруктураЗаметки.Свойство("html") И СтруктураЗаметки.html.Свойство("body") И СтруктураЗаметки.html.body.Свойство("p") Тогда
		Если ТипЗнч(СтруктураЗаметки.html.body.p) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из СтруктураЗаметки.html.body.p Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
					ТекстПараграфа = ТекстПараграфа +  Символы.ПС;
				Иначе
					ТекстПараграфа = ТекстПараграфа + ЭлементМассива;   
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекстПараграфа = СтруктураЗаметки.html.body.p;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстПараграфа;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПреобразование(Команда)
	ВыполнитьПреобразованиеНаСервере();
КонецПроцедуры

#Область РазборФайла

&НаСервере
Функция РазобратьXML()
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Объект.ИмяФайла);
	ФайлXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	РезультатЧтения = РазобратьОбъектXDTO(ФайлXDTO);
	Возврат РезультатЧтения;
КонецФункции

&НаСервере
Функция РазобратьОбъектXDTO(Элемент)
	Результат = Новый Структура;
	Для каждого Свойство из Элемент.Свойства() Цикл
		Если ТипЗнч(Элемент[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
			Результат.Вставить(Свойство.Имя, РазобратьОбъектXDTO(Элемент[Свойство.Имя]));
		ИначеЕсли ТипЗнч(Элемент[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			Результат.Вставить(Свойство.Имя,РазобратьСписокXDTO(Элемент[Свойство.Имя]));
		Иначе
			Результат.Вставить(Свойство.Имя,Элемент[Свойство.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция РазобратьСписокXDTO(СписокЭлементов)
	Результат = Новый Массив;
	Для каждого Элемент из СписокЭлементов Цикл
		Если ТипЗнч(Элемент) = Тип("ОбъектXDTO") Тогда
			Результат.Добавить(РазобратьОбъектXDTO(Элемент));
		Иначе
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти