
&НаСервере
Процедура ВыполнитьПреобразованиеНаСервере()
	РезультатЧтения = РазобратьXML();
КонецПроцедуры

&НаСервере
Функция ПрочитатьФайл()
КонецФункции

&НаКлиенте
Процедура ВыполнитьПреобразование(Команда)
	ВыполнитьПреобразованиеНаСервере();
КонецПроцедуры

&НаСервере
Функция РазобратьXML()
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Объект.ИмяФайла);
	ФайлXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	РезультатЧтения = РазобратьОбъектXDTO(ФайлXDTO);
	Возврат РезультатЧтения;
КонецФункции

&НаСервере
Функция РазобратьОбъектXDTO(Элемент)
	Результат = Новый Структура;
	Для каждого Свойство из Элемент.Свойства() Цикл
		Если ТипЗнч(Элемент[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
			Результат.Вставить(Свойство.Имя, РазобратьОбъектXDTO(Элемент[Свойство.Имя]));
		ИначеЕсли ТипЗнч(Элемент[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			Результат.Вставить(Свойство.Имя,РазобратьСписокXDTO(Элемент[Свойство.Имя]));
		Иначе
			Результат.Вставить(Свойство.Имя,Элемент[Свойство.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция РазобратьСписокXDTO(СписокЭлементов)
	Результат = Новый Массив;
	Для каждого Элемент из СписокЭлементов Цикл
		Результат.Добавить(РазобратьОбъектXDTO(Элемент));
	КонецЦикла;
	Возврат Результат;
КонецФункции

