
&НаСервере
Процедура ВыполнитьПреобразованиеНаСервере()
	РезультатЧтения = РазобратьXML();
	ТитульныйЛист = СформироватьТитульныйЛист(РезультатЧтения);
КонецПроцедуры

&НаСервере
Функция СформироватьТитульныйЛист(РезультатЧтения)
	//ВызватьИсключение "Не реализовано";
	ТитульныйЛист = Новый ТекстовыйДокумент;  
	ТитульныйЛист.ДобавитьСтроку("\thispagestyle{titlepage}");
	ТитульныйЛист.ДобавитьСтроку("");
	ТитульныйЛист.ДобавитьСтроку("\vspace*{8cm}");
	ТитульныйЛист.ДобавитьСтроку("");
	ТитульныйЛист.ДобавитьСтроку("\begin{center}");
	ТитульныйЛист.ДобавитьСтроку("    {\LARGE "+РезультатЧтения.node.TEXT+"\\ [1cm] }");
	ТитульныйЛист.ДобавитьСтроку("\end{center}");

	Возврат ТитульныйЛист;
КонецФункции

&НаСервере
Функция ПолучитьТекстПараграфа(СтруктураЗаметки)
	ТекстПараграфа = "";
	Если СтруктураЗаметки.Свойство("html") И СтруктураЗаметки.html.Свойство("body") И СтруктураЗаметки.html.body.Свойство("p") Тогда
		Если ТипЗнч(СтруктураЗаметки.html.body.p) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из СтруктураЗаметки.html.body.p Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
					ТекстПараграфа = ТекстПараграфа +  Символы.ПС;
				Иначе
					ТекстПараграфа = ТекстПараграфа + ЭлементМассива;   
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекстПараграфа = СтруктураЗаметки.html.body.p;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстПараграфа;
КонецФункции

&НаКлиенте
Процедура ВыполнитьПреобразование(Команда)
	ВыполнитьПреобразованиеНаСервере();
КонецПроцедуры

#Область РазборФайла

&НаСервере
Функция РазобратьXML()
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Объект.ИмяФайла);
	ФайлXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	РезультатЧтения = РазобратьОбъектXDTO(ФайлXDTO);
	Возврат РезультатЧтения;
КонецФункции

&НаСервере
Функция РазобратьОбъектXDTO(Элемент)
	Результат = Новый Структура;
	Для каждого Свойство из Элемент.Свойства() Цикл
		Если ТипЗнч(Элемент[Свойство.Имя]) = Тип("ОбъектXDTO") Тогда
			Результат.Вставить(Свойство.Имя, РазобратьОбъектXDTO(Элемент[Свойство.Имя]));
		ИначеЕсли ТипЗнч(Элемент[Свойство.Имя]) = Тип("СписокXDTO") Тогда
			Результат.Вставить(Свойство.Имя,РазобратьСписокXDTO(Элемент[Свойство.Имя]));
		Иначе
			Результат.Вставить(Свойство.Имя,Элемент[Свойство.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция РазобратьСписокXDTO(СписокЭлементов)
	Результат = Новый Массив;
	Для каждого Элемент из СписокЭлементов Цикл
		Если ТипЗнч(Элемент) = Тип("ОбъектXDTO") Тогда
			Результат.Добавить(РазобратьОбъектXDTO(Элемент));
		Иначе
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти